var exercise = [
  {
    'step': '动作一',
    'title': '麦肯基坐式头部回缩运动',
    'start': '坐在椅子上，平视前方，并完全放松',
    'process': '缓慢且平稳的向后移动头部，直到不能再向后为止，然后保持5秒钟，回复初始位置',
    'note': '过程中不要将下巴翘起',
    'muscle': '头长肌、颈长肌',
    'time': '时长：5秒 休息：10秒',
    'set':  '次数：4',
    'url': 'https://www.kfxl.link:12306/images/1.png',
    'video': ''
  },
  {
    'step': '动作二',
    'title': '麦肯基坐式头部回缩运动进阶',
    'start': '坐在椅子上，平视前方，并完全放松',
    'process': '双手扶住下巴，缓慢且平稳的向后移动头部，直到不能再向后为止，然后保持5秒钟，回复初始位置',
    'note': '过程中不要将下巴翘起',
    'muscle': '头长肌、颈长肌',
    'time': '时长：5秒 休息：12秒',
    'set':  '次数：4',
    'url': 'https://www.kfxl.link:12306/images/2.png'
  },
  {
    'step': '动作三',
    'title': '麦肯基坐式颈部伸展运动',
    'start': '坐在椅子上，头部保持回缩姿势',
    'process': '抬起下巴，头部尽量后仰，然后头部向左右转动。重复3组后恢复到初始姿势',
    'note': '每次练习时尽量做到最大幅度',
    'muscle': '斜方肌、头夹肌、颈夹肌、头半棘肌、头最长肌、颈最长肌',
    'time': '时长：15秒 休息：5秒',
    'set':  '次数：4',
    'url': 'https://www.kfxl.link:12306/images/3.png'
  },
  {
    'step': '动作四',
    'title': '麦肯基平躺头部回缩运动',
    'start': '仰卧，目视天花板',
    'process': '用头部力量使头部贴近地面，同时收回下颚，保持几秒后回复初始位置',
    'note': '每次练习时尽量做到最大幅度',
    'muscle': '头长肌、颈长肌',
    'time': '时长：5秒 休息：10秒',
    'set':  '次数：4',
    'url': 'https://www.kfxl.link:12306/images/4.png'
  },
  {
    'step': '动作五',
    'title': '麦肯基仰卧颈部伸展运动',
    'start': '仰卧，躺在床边用一只手支撑头部，使你的头、脖子和肩膀都露在床沿外',
    'process': '用手支撑头部同时，缓慢地仰头，然后慢慢移开手，尽可能看向地板，保持这一姿势同时，头部稍稍左右转动，并继续保持后仰，持续3秒，最后回复初始位置',
    'note': '完成这一动作后，不要立即起身。平躺休息一分钟',
    'muscle': '斜方肌、头夹肌、颈夹肌、头半棘肌、头最长肌、颈最长肌',
    'time': '时长：5秒 休息：10秒',
    'set':  '次数：4',
    'url': 'https://www.kfxl.link:12306/images/5.png'
  },
  {
    'step': '动作一',
    'title': '斜角肌拉伸',
    'start': '站姿或坐姿，双手紧握在背后',
    'process': '左肩下沉，头向右倾斜，直到感觉到伸展后保持这个位置15到30秒，然后回到起始位置。重复对侧拉伸',
    'note': '无',
    'muscle': '斜角肌',
    'time': '时长：15-30秒 休息：10秒',
    'set':  '次数：3',
    'url': 'https://www.kfxl.link:12306/images/6.png'
  },
  {
    'step': '动作二',
    'title': '胸椎后伸运动',
    'start': '坐在椅子上，双手抱在脑后',
    'process': '扩胸，轻轻的向后弯，仰望天花板，到最大限度后回复初始位置',
    'note': '无',
    'muscle': '多裂肌、竖脊肌、斜方肌',
    'time': '时长：15秒 休息：10秒',
    'set':  '次数：3',
    'url': 'https://www.kfxl.link:12306/images/7.png'
  },
  {
    'step': '动作三',
    'title': '颈屈旋转拉伸',
    'start': '站姿双手抱头，把头转向右边',
    'process': '用的手臂的重量使你的下巴靠近胸部的右侧，保持15秒。放松然后重复对侧训练',
    'note': '无',
    'muscle': '肩胛提肌、斜方肌、头夹肌、颈夹肌',
    'time': '时长：5秒 休息：12秒',
    'set':  '次数：3',
    'url': 'https://www.kfxl.link:12306/images/8.png'
  },
  {
    'step': '动作四',
    'title': '颈正位屈曲',
    'start': '站姿或坐姿',
    'process': '把你的指尖放在下巴上，然后轻轻地把你的头往后推，如同双下巴样。保持5秒',
    'note': '当你的头向后移动时，目视前方',
    'muscle': '头长肌、颈长肌',
    'time': '时长：15秒 休息：20秒',
    'set':  '次数：3',
    'url': 'https://www.kfxl.link:12306/images/1.png'
  },
  {
    'step': '动作五',
    'title': '颈部旋转拉伸放松',
    'start': '站姿或坐姿',
    'process': '转动脖子，眼睛看上右肩。用手放在下巴左边，借助手掌力量把下巴推到右肩。保持10秒然后恢复初始状态，拉伸另一侧',
    'note': '无',
    'muscle': '头夹肌、颈夹肌、头下斜肌、头后大直肌',
    'time': '时长：30秒 休息：5秒',
    'set':  '次数：3',
    'url': 'https://www.kfxl.link:12306/images/2.png'
  },
  {
    'step': '动作一',
    'title': '颈部旋转拉伸',
    'start': '站姿或坐姿',
    'process': '转动脖子，眼睛看上右肩。用手放在下巴左边，借助手掌力量把下巴推到右肩。保持10秒然后恢复初始状态，拉伸另一侧',
    'note': '无',
    'muscle': '头夹肌、颈夹肌、头下斜肌、头后大直肌',
    'time': '时长：30秒 休息：5秒',
    'set':  '次数：3',
    'url': 'https://www.kfxl.link:12306/images/2.png'
  },
  {
    'step': '动作二',
    'title': '肩胛后缩运动',
    'start': '站姿或坐姿',
    'process': '双臂在身后侧，肩胛骨向正中线发力，感受肩胛骨挤压。达到最大限度后，保持5秒，后放松',
    'note': '无',
    'muscle': '菱形肌、斜方肌',
    'time': '时长：30秒 休息：10秒',
    'set':  '次数：3',
    'url': 'https://www.kfxl.link:12306/images/3.png'
  },
  {
    'step': '动作三',
    'title': '仰卧颈部卷曲',
    'start': '仰卧，膝盖弯曲，双脚平躺在地板上，上手自然前身，放在身体两侧',
    'process': '收下巴，屈颈， 使头抬离地面大约8cm，然后保持10秒。然后回复到初始位置',
    'note': '肩部贴近地面不要悬空',
    'muscle': '前斜角肌、胸锁乳突肌、颈长肌、头长肌',
    'time': '时长：15秒 休息：10秒',
    'set':  '次数：3',
    'url': 'https://www.kfxl.link:12306/images/4.png'
  },
  {
    'step': '动作四',
    'title': '主动颈部侧弯曲',
    'start': '坐在椅子上，保持脖子、肩膀和躯干挺直',
    'process': '头向一侧倾斜，使你的右耳贴向右肩。直到感觉到对侧颈部拉伸。保持5秒后，恢复初始位置，然后重复对侧练习',
    'note': '头部不要旋转；不要耸肩',
    'muscle': '头夹肌、颈夹肌、胸锁乳突肌、斜角肌',
    'time': '时长：15秒 休息：5秒',
    'set':  '次数：3',
    'url': 'https://www.kfxl.link:12306/images/5.png'
  },
  {
    'step': '动作五',
    'title': '颈部屈曲',
    'start': '坐姿',
    'process': '坐在椅子上，保持脖子、肩膀和躯干挺直。头向前弯，下巴朝胸。坚持5秒，然后回复初始姿势',
    'note': '保持脖子、肩膀和躯干挺直；均匀呼吸不要憋气',
    'muscle': '前斜角肌、胸锁乳突肌、颈长肌、头长肌',
    'time': '时长：20秒 休息：10秒',
    'set':  '次数：3',
    'url': 'https://www.kfxl.link:12306/images/6.png'
  },
]

module.exports.exerDoc = exercise;
module.exports.indexOf = function(name){
  var list = exercise.map(a => a.title)
  const index = list.indexOf(name)
  return index
}